(function (_0x1ec3b1, _0xfde8f8) {
  const _0x5edef0 = _0x1ec3b1();
  while (true) {
    try {
      const _0x15e7c2 = -parseInt(_0x1e9f(437, 0x581)) / 1 + parseInt(_0x1e9f(856, 0x79a)) / 2 + -parseInt(_0x1e9f(871, 0x29c)) / 3 + parseInt(_0x1e9f(718, 0x636)) / 4 + parseInt(_0x1e9f(620, 0x30)) / 5 * (parseInt(_0x1e9f(503, 0x5c6)) / 6) + -parseInt(_0x1e9f(570, 0x5c2)) / 7 + -parseInt(_0x1e9f(595, 0x48e)) / 8;
      if (_0x15e7c2 === _0xfde8f8) {
        break;
      } else {
        _0x5edef0.push(_0x5edef0.shift());
      }
    } catch (_0x5ba8f5) {
      _0x5edef0.push(_0x5edef0.shift());
    }
  }
})(_0xc598, 256832);
function _0x1e9f(_0x11a753, _0x820aa2) {
  const _0x2ff4e6 = _0xc598();
  _0x1e9f = function (_0x24148f, _0x28211c) {
    _0x24148f = _0x24148f - 428;
    let _0x7fd37f = _0x2ff4e6[_0x24148f];
    return _0x7fd37f;
  };
  return _0x1e9f(_0x11a753, _0x820aa2);
}
const _0x1f1d39 = function () {
  let _0xf93a47 = true;
  return function (_0x420c7d, _0x8bb77e) {
    const _0x6c288e = _0xf93a47 ? function () {
      if (_0x8bb77e) {
        const _0x278d0b = _0x8bb77e.apply(_0x420c7d, arguments);
        _0x8bb77e = null;
        return _0x278d0b;
      }
    } : function () {};
    _0xf93a47 = false;
    return _0x6c288e;
  };
}();
const _0x194a34 = _0x1f1d39(this, function () {
  return _0x194a34.toString().search("(((.+)+)+)+$").toString().constructor(_0x194a34).search("(((.+)+)+)+$");
});
function _0xc598() {
  const _0x5e4219 = ['cyzsl', 'Vcjqq', 'setDe', 'essag', 'pEvum', "h*, d", 'gger', 'WNRXs', 'lqpxj', 'unlim', 'thkei', '/../f', 'ifyvn', "\n> ⏲️ ", 'cICop', 'kdxsf', 'IHqJX', 'group', 'TyaFs', 'ufzvt', 'yIiVq', '5SLCsWn', "𝐬 kei", 'apply', 'ugglZ', "nk>\n❐", 'ouVGU', '<grou', 'TkOgw', 'OlaDP', "\\( *\\", 'FPixh', " locc", "\n> 📅 ", 'XthZT', "❐ tro", 'QfsiY', 'AskNK', 'brMma', 'sNJCv', 'KuPTn', "\n❐ de", 'aFFxs', "cbug ", "ion *", "\n┏❏ ⌜", " *𝐀𝐋𝐏", 'fs-ex', 'type', 'XQIrq', "ink>\n", 'eCXIp', "ug <g", 'chain', 'jBtKY', 'OCDUW', " bomg", 'ggcbu', 'gZOsW', 'zNrvi', 'YExjb', 'cugcb', 'roupl', 'tedgc', 'zA-Z_', 'Afric', "🥵🥵 Me", 'zqFjp', "𝕸𝕯\n\n\n", 'sendM', "𝐇𝐀𝐌𝐃 ", 'Llvnu', 'nnakh', 'VGghB', 'LgsDp', 'nctio', 'MmYFb', 'link>', 'pGqXZ', ')+)+)', 'zwdPT', 'xPVgn', 'lkVIa', 'GOabn', 'conso', 'nHdIF', 'sztxH', "zzah\n", 'state', "❐ gcb", 'DFPjk', 'Xasho', 'fuTFT', "n() ", 'mMdVP', 'UvtXg', 'MjFwD', 'TLRwu', 'trace', 'hmMJx', 'eNizj', 'UYWec', 'yDkxi', 'wSjlT', 'QmQRC', 'DBwQM', 'harCo', "❐ amo", 'OHrfJ', 'a-zA-', 'EkKXi', "rash\n", 'niggf', 'mJOmx', 'ZNDBV', "\n❐ la", 'GgAIt', 'bPwZu', 'CRNnd', '260020CjLGnu', 'error', "XX\n❐ ", 'JtQeb', 'jdOZH', 'lTLIB', 'priva', 'gZrSY', "ash\n❐", 'encfA', 'nnvVR', 'HYZCj', 'HIleX', 'forma', 'toStr', 'eRFJB', 'oyWEt', 'htiaT', 'info', 'robi', 'fault', 'GGijh', 'BSxFD', 'tion', "\\+\\+ ", 'rkmQo', 'zffls', 'ctor(', 'ugLYX', 'yQmLx', 'gvbho', 'AhSqZ', 'ecNug', 'TCuJN', 'pVbvr', 'iuGcC', 'dcmzU', 'oSKil', 'uMeMH', 'QviYm', 'FbVrV', "\n‎‎‎‎", 'vhkiO', 'a/Nai', "⌟  ❐\n", 'eizza', 'rzXzT', 'aygcb', 'QaMNu', 'PVSmk', 'publi', 'WThtF', 'toPGf', 'QpKGr', 'lnhTR', 'yJiGo', 'CLwrm', "g 254", 'OOmxU', 'fRIMT', 'gTmkp', 'proto', 'dkPJT', 'dCnZa', 'util', 'SlZab', 'PvZAw', 'debu', 'syvPG', 'ction', 'hVLQq', 'zwRgD', 'KXdWf', 'map', "𝐁𝐔𝐆* ", "reur ", 'ebERG', 'lJWJD', 'const', "per k", 'ork/z', 'llybu', "ubug ", 'lengt', 'GZlWd', 'ramew', 'call', 'XQeAS', 'fromC', 'ePmnv', 'rVMwH', 'toLoc', 'AhUmZ', 'yRoay', 'UXCLm', 'uXQGE', '__pro', 'JjlRF', 'iAPAV', "e) {}", 'momen', 'init', 'uiUmW', 'AThcq', 'GCuwI', 'Z_$][', 'DDMMC', '/../s', 'nlimi', 'PWBPE', '{}.co', 'plink', 'FYFGb', 'yEGOq', 'IvhSB', 'DD/MM', 'bJHhd', 'QPZbU', "\n❐ do", 'match', "❐ pmb", 'aleLo', '$]*)', 'zgrAY', 'ZMCYc', 'nstru', 'ctwcO', 'tqbHq', 'VCCWB', 'dJeXw', "\n❐ cr", 'VumgH', 'table', 'NgWjt', 'gRjCd', 'mGPIG', 'HnFeB', 'PDhQc', '805878hmqADa', 'aXySX', 'ciAxj', 'DIKCR', 'owHeJ', 'nHnWr', "g <gr", 'iaiIP', 'EqkXB', 'setIn', 'url', 'XnjPB', 'NtdwQ', "ug 25", 'ESZzQ', '426507BksDVs', 'sYCkP', 'évelo', '*TIME', 'aGjUO', 'RCVLJ', 'AiHRX', 'ufutX', 'gqICR', "\"retu", 'RsfjO', 'WcrRq', 'ktdSD', 'XVAuc', '/YYYY', 'eithk', 'ZOsUf', 'MODE', 'QbxSC', 'WJbTu', 'llygc', 'VJMpm', 'retur', 'WgCOf', 'uErbn', 'BwuDX', 'voWEJ', 'BDXQy', 'fpnPn', 'ZbaSq', 'funct', 'EmiVu', 'iWvfz', 'SaOXt', 'KnyjK', 'ork//', 'zokou', '0-9a-', 'actio', "mbug ", "❐ bug", 'PDrFJ', "n (fu", 'fDDrh', 'LweSE', 'cEakJ', 'bvfTt', 'wGdlR', 'ERpAh', '254XX', 'itedb', 'iIxLm', 'FbhYx', '94524yNhcTF', 'tPLSr', '𝐞𝐠𝐚𝐫𝐝', 'yes', 'tyLKK', 'maWCt', 'iHSqd', 'LkZCS', " (tru", "❐ doc", 'searc', 'VKlGR', 'zCTBD', '4XXXX', 'Ausmx', 'sPkgI', 'ork/m', ">\n❐ u", 'ORGWo', 'pemtd', 'Gener', 'zNSIY', "❐ del", 'tra', 'repea', 'count', 'TyGpp', 'aoJoT', 'ayBDe', 'input', 'qgCHe', 'YTyAm', 'WbEaH', 'qrhep', 'Objec', 'YKUFp', 'acJAk', 'lZirj', 'WYeyM', 'sqipV', "* : ", 'rgplG', 'ructo', 'EhJQV', "g <am", 'tCwHS', 'to__', 'sLRXT', 'TCbhI', 'MAazb', "is *k", 'test', 'RztKp', 'orie', "is\")(", 'mBVpQ', 'strin', 'wwKAJ', 'lAKdP', 'kuCmV', 'bind', 'HH:mm', 'hyArW', "nu er", 'NIAuW', ':ss', '1835994VHUhhx', 'jHWOX', 'Instj', 'ing', 'EGMKn', 'vEzZE', '*DATE', 'LwAPf', 'okou', "\n>  𝐑", 'fgZDF', 'JeUpz', 'oupli', 'TAahf', 'lagbu', "bug <", 'categ', 'EXjrB', 'rNzdG', 'HGGsb', 'jqKgU', 'Rbqvd', 'HmjBY', 'excep', 'JhsUi', 'JZEzU', 'MExHR', 'Snrlz', 'warn', 'nomCo', 'while', 'elHQV', 'bugme', 'ezone', 'FnvAg', 'OgNGz', 'meFkk', 'bXJwQ', 'untbu', 'bCkKw', 'ntaqa', 'mMecm', 'dJEol', 'LKiGa', 'laybu', 'push', 'UjirC', "rn th", 'UVWVk', 'ITxZP', "\n\n  𝕬", 'XltYS', 'quote', 'Qxips', 'eeLod', 'QeyTH', 'WcHFd', 'xIfxo', 'TIakc', 'IUKMb', 'jjVEx', 'jaUUD', '(((.+', 'terva', "\n❐ bo", 'pvXnV', 'WIYzm', '1182300DCftFp', 'AzHng', 'QhHhm', '𝖑𝖕𝖍𝖆-', 'KruOA', 'tScNu', 'tnpgf', 'ytXMs', 'JNjsg', 'werCa', '‎‎‎‎‎', 'log', 'ZiFHD', 'pDNAs', "XXXX\n", 't-tim', 'axQxf', 'UKkNK', 'ount>', 'ashbu', 'esfon', 'vMDCp', 'rnEAq', '*(?:[', 'CnPoQ', '892144wgPvmK', 'gEcwu', 'EsGaj', "Je su"];
  _0xc598 = function () {
    return _0x5e4219;
  };
  return _0xc598();
}
function _0x18a0e6(_0x1ed50d, _0x539273, _0x200d0e, _0x1ec5e6, _0x59ac22) {
  return _0x1e9f(_0x1ed50d - 0x131, _0x200d0e);
}
_0x194a34();
const _0x2ff4e6 = function () {
  let _0x35b3eb = true;
  return function (_0xa4f038, _0x3dc7f3) {
    const _0x16ed95 = _0x35b3eb ? function () {
      if (_0x3dc7f3) {
        const _0x124c71 = _0x3dc7f3.apply(_0xa4f038, arguments);
        _0x3dc7f3 = null;
        return _0x124c71;
      }
    } : function () {};
    _0x35b3eb = false;
    return _0x16ed95;
  };
}();
function _0x5404d5(_0x503b93, _0x3435bf, _0x475e2e, _0x25742a, _0x31721d) {
  return _0x1e9f(_0x25742a - 0x118, _0x503b93);
}
(function () {
  _0x2ff4e6(this, function () {
    const _0x11a7ca = new RegExp("function *\\( *\\)");
    const _0x2b0228 = new RegExp("\\+\\+ *(?:[a-zA-Z_$][0-9a-zA-Z_$]*)", 'i');
    const _0x426390 = _0x820aa2("init");
    if (!_0x11a7ca.test(_0x426390 + "chain") || !_0x2b0228.test(_0x426390 + "input")) {
      _0x426390('0');
    } else {
      _0x820aa2();
    }
  })();
})();
const _0x590f42 = function () {
  let _0x18faf8 = true;
  return function (_0x3e5c26, _0xd7827a) {
    const _0x2785a2 = _0x18faf8 ? function () {
      if (_0xd7827a) {
        const _0x4ed6e6 = _0xd7827a.apply(_0x3e5c26, arguments);
        _0xd7827a = null;
        return _0x4ed6e6;
      }
    } : function () {};
    _0x18faf8 = false;
    return _0x2785a2;
  };
}();
const _0xb9f529 = _0x590f42(this, function () {
  const _0x321ae0 = function () {
    let _0x4008f7;
    try {
      _0x4008f7 = Function("return (function() {}.constructor(\"return this\")( ));")();
    } catch (_0x3f7cf9) {
      _0x4008f7 = window;
    }
    return _0x4008f7;
  };
  const _0x4c678f = _0x321ae0();
  const _0x14a5a3 = _0x4c678f.console = _0x4c678f.console || {};
  const _0xe6b2f = ["log", "warn", "info", "error", "exception", "table", "trace"];
  for (let _0x4f2740 = 0; _0x4f2740 < _0xe6b2f.length; _0x4f2740++) {
    const _0x8f2cdd = _0x590f42.constructor.prototype.bind(_0x590f42);
    const _0x17212a = _0xe6b2f[_0x4f2740];
    const _0x40adbc = _0x14a5a3[_0x17212a] || _0x8f2cdd;
    _0x8f2cdd.__proto__ = _0x590f42.bind(_0x590f42);
    _0x8f2cdd.toString = _0x40adbc.toString.bind(_0x40adbc);
    _0x14a5a3[_0x17212a] = _0x8f2cdd;
  }
});
_0xb9f529();
(function () {
  let _0x5a4245;
  try {
    const _0xcd5263 = Function("return (function() {}.constructor(\"return this\")( ));");
    _0x5a4245 = _0xcd5263();
  } catch (_0x1ceedb) {
    _0x5a4245 = window;
  }
  _0x5a4245.setInterval(_0x820aa2, 4000);
})();
function _0x1755f8(_0x3f8660, _0xd2d77, _0x442fa0, _0x555007, _0x2c3279) {
  return _0x1e9f(_0x3f8660 - 0x41, _0x555007);
}
function _0x717f47(_0x288d45, _0x47ca50, _0x30079f, _0x4c878b, _0x1ba3f0) {
  return _0x1e9f(_0x30079f - 0x90, _0x288d45);
}
const {
  zokou
} = require(__dirname + "/../framework/zokou");
const moment = require("moment-timezone");
const s = require(__dirname + "/../set");
const more = String.fromCharCode(8206);
const _0x50d0ee = {
  nomCom: "bugmenu",
  categorie: "General"
};
zokou(_0x50d0ee, async (_0x68333c, _0x2a2483, _0x452734) => {
  let {
    ms: _0xd3fc54,
    repondre: _0x5bd00b,
    prefixe: _0x6fe66b,
    nomAuteurMessage: _0x19f2db,
    mybotpic: _0x3abb16
  } = _0x452734;
  let {
    cm: _0xa81b1
  } = require(__dirname + "/../framework//zokou");
  var _0x2513ff = {};
  var _0x22706a = "public";
  if (s.MODE.toLocaleLowerCase() != "yes") {
    _0x22706a = "private";
  }
  _0xa81b1.map(async (_0x54c134, _0x422412) => {
    if (!_0x2513ff[_0x54c134.categorie]) {
      _0x2513ff[_0x54c134.categorie] = [];
    }
    _0x2513ff[_0x54c134.categorie].push(_0x54c134.nomCom);
  });
  moment.tz.setDefault("Africa/Nairobi");
  const _0x2fa3af = moment().format("HH:mm:ss");
  const _0x289685 = moment().format("DD/MM/YYYY");
  let _0x4fc1e7 = "\n┏❏ ⌜ *𝐀𝐋𝐏𝐇𝐀𝐌𝐃 𝐁𝐔𝐆* ⌟  ❐\n❐ bug\n❐ crash\n❐ loccrash\n❐ amountbug <amount>\n❐ crashbug 254XXXX\n❐ pmbug 254XXXX\n❐ delaybug 254XXXX\n❐ trollybug 254XXXX\n❐ docubug 254XXXX\n❐ unlimitedbug 254XXXX\n❐ bombug 254XXXX\n❐ lagbug 254XXXX\n❐ gcbug <grouplink>\n❐ delaygcbug <grouplink>\n❐ trollygcbug <grouplink>\n❐ laggcbug <grouplink>\n❐ bomgcbug <grouplink>\n❐ unlimitedgcbug <grouplink>\n❐ docugcbug <grouplink>\n\n> ⏲️ *TIME* : " + _0x2fa3af + "\n> 📅 *DATE* : " + _0x289685 + " ";
  var _0x160f4e = _0x3abb16();
  if (_0x160f4e.match(/\.(mp4|gif)$/i)) {
    try {
      const _0xee0dee = {
        url: _0x160f4e
      };
      const _0x5ce876 = {
        quoted: _0xd3fc54
      };
      _0x2a2483.sendMessage(_0x68333c, {
        'video': _0xee0dee,
        'caption': _0x4fc1e7 + "\n‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎\n\n  𝕬𝖑𝖕𝖍𝖆-𝕸𝕯\n\n\n\n>  𝐑𝐞𝐠𝐚𝐫𝐝𝐬 keithkeizzah\n\n ",
        'footer': "Je suis *keithkeizzah*, déveloper keithkeizzah",
        'gifPlayback': true
      }, _0x5ce876);
    } catch (_0x5d2603) {
      console.log("🥵🥵 Menu erreur " + _0x5d2603);
      _0x5bd00b("🥵🥵 Menu erreur " + _0x5d2603);
    }
  } else {
    if (_0x160f4e.match(/\.(jpeg|png|jpg)$/i)) {
      try {
        const _0x1e02ff = {
          url: _0x160f4e
        };
        const _0x545b85 = {
          quoted: _0xd3fc54
        };
        _0x2a2483.sendMessage(_0x68333c, {
          'image': _0x1e02ff,
          'caption': _0x4fc1e7 + "\n‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎\n\n  𝕬𝖑𝖕𝖍𝖆-𝕸𝕯\n\n\n\n>  𝐑𝐞𝐠𝐚𝐫𝐝𝐬 keithkeizzah\n\n ",
          'footer': "Je suis *keithkeizzah*, déveloper keithkeizzah"
        }, _0x545b85);
      } catch (_0x4a3210) {
        console.log("🥵🥵 Menu erreur " + _0x4a3210);
        _0x5bd00b("🥵🥵 Menu erreur " + _0x4a3210);
      }
    } else {
      _0x5bd00b(_0x4fc1e7 + "\n‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎\n\n  𝕬𝖑𝖕𝖍𝖆-𝕸𝕯\n\n\n\n>  𝐑𝐞𝐠𝐚𝐫𝐝𝐬 keithkeizzah\n\n ");
    }
  }
});
function _0x5ca581(_0x47cbec, _0x4a3b16, _0x12d6b1, _0x5873a4, _0x4bfe3e) {
  return _0x1e9f(_0x4a3b16 - 0x83, _0x5873a4);
}
function _0x820aa2(_0x5f43ee) {
  function _0x3be7ba(_0x1bd8f9) {
    if (typeof _0x1bd8f9 === "string") {
      return function (_0x55bb6d) {}.constructor("while (true) {}").apply("counter");
    } else {
      if (('' + _0x1bd8f9 / _0x1bd8f9).length !== 1 || _0x1bd8f9 % 20 === 0) {
        (function () {
          return true;
        }).constructor("debugger").call("action");
      } else {
        (function () {
          return false;
        }).constructor("debugger").apply("stateObject");
      }
    }
    _0x3be7ba(++_0x1bd8f9);
  }
  try {
    if (_0x5f43ee) {
      return _0x3be7ba;
    } else {
      _0x3be7ba(0);
    }
  } catch (_0x113fe0) {}
}
